eSocial/S1000_vitor.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
xmlns:v1="http://www.esocial.gov.br/schema/lote/eventos/envio/v1_1_1" 
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<v1:EnviarLoteEventos>
<v1:loteEventos>
<eSocial xmlns="http://www.esocial.gov.br/schema/lote/eventos/envio/v1_1_1">
  <envioLoteEventos grupo="1">
    <ideEmpregador>
      <tpInsc>1</tpInsc>
      <nrInsc>96533310000140</nrInsc>
    </ideEmpregador>
    <ideTransmissor>
      <tpInsc>1</tpInsc>
      <nrInsc>96533310000140</nrInsc>
    </ideTransmissor>
    <eventos>
      <evento Id="ID1123456780000002017082410324100001">
<eSocial xmlns="http://www.esocial.gov.br/schema/evt/evtInfoEmpregador/v02_04_02">
   <evtInfoEmpregador Id="ID1965333100001402018042515510000000">
     <ideEvento>
       <tpAmb>9</tpAmb>
       <procEmi>1</procEmi>
       <verProc>2018.01.00.00</verProc>
     </ideEvento>
     <ideEmpregador>
       <tpInsc>1</tpInsc>
       <nrInsc>96533310</nrInsc>
     </ideEmpregador>
     <infoEmpregador>
       <inclusao>
         <idePeriodo>
           <iniValid>201804</iniValid>
           <fimValid>301804</fimValid>
         </idePeriodo>
         <infoCadastro>
           <nmRazao>Contador Amigo Ltda - ME</nmRazao>
           <classTrib>02</classTrib>
           <natJurid>206-2</natJurid>
           <indCoop>0</indCoop>
           <qwer>0</qwer>
           <indConstr>0</indConstr>
           <indDesFolha>0</indDesFolha>
           <indOptRegEletron>1</indOptRegEletron>
		   <indEntEd>0</indEntEd>
		   <indEtt>0</indEtt>
		   <nrRegEtt></nrRegEtt>
			<contato>
             <nmCtt>Vitor Maradei</nmCtt>
             <cpfCtt>08205896836</cpfCtt>
             <foneFixo>1134346631</foneFixo>
             <foneCel></foneCel>
             <fax></fax>
             <email>vitor@contadoramigo.com.br</email>
           </contato>
           <softwareHouse>
             <cnpjSoftHouse>96533310000140</cnpjSoftHouse>
             <nmRazao>Contador Amigo Ltda</nmRazao>
             <nmCont>Vitor Maradei</nmCont>
             <telefone>1134346631</telefone>
             <email>vitor@contadoramigo.com.br</email>
           </softwareHouse>
           <infoComplementares>
             <situacaoPJ>
               <indSitPJ>0</indSitPJ>
             </situacaoPJ>
             <situacaoPF>
               <indSitPF>0</indSitPF>
             </situacaoPF>
           </infoComplementares>
         </infoCadastro>
       </inclusao>
     </infoEmpregador>
   </evtInfoEmpregador>
          <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
            <SignedInfo>
              <CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315" />
              <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256" />
              <Reference URI="">
                <Transforms>
                  <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
                  <Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315" />
                </Transforms>
                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
                <DigestValue> [...] </DigestValue>
              </Reference>
            </SignedInfo>
            <SignatureValue> [...] </SignatureValue>
            <KeyInfo>
              <X509Data>
                <X509Certificate> [...] </X509Certificate>
              </X509Data>
            </KeyInfo>
          </Signature>
        </eSocial>
      </evento>
    </eventos>
  </envioLoteEventos>
</eSocial>
</v1:loteEventos>
</v1:EnviarLoteEventos>
</soap:Body>
</soap:Envelope>